In [3]:
# 1. Load the dataset in Pandas
import pandas as pd
student = pd.read_excel("C:\\Users\\XNovaQ.23\\Downloads\\students_assignment_data.xlsx")
print(student)

      StudentID             Name  Age Gender  Total_Marks       City
0          1001  Timothy Mendoza   14      M        365.0      Delhi
1          1002   Taylor Jackson   14      F        327.0      Delhi
2          1003   Erica Lawrence   13      F        343.0  Bangalore
3          1004    Rachel Murray   15      M        289.0    Kolkata
4          1005      Jesse Horne   17      M        356.0  Bangalore
...         ...              ...  ...    ...          ...        ...
1495       2496      Mark Horton   18      F        296.0    Kolkata
1496       2497    Lisa Johnston   14      F        223.0  Bangalore
1497       2498  Denise Campbell   16      M        258.0     Mumbai
1498       2499    Angel Sanders   18      M        240.0    Chennai
1499       2500  Virginia Warren   13      F        187.0    Chennai

[1500 rows x 6 columns]

In [4]:
#2. Display first 15 rows, data types, and dataset shape.
h = student.head(15)
print( "Data set shape:",h.shape)
print("Data Types :\n",h.dtypes)

Data set shape: (15, 6)
Data Types :
 StudentID        int64
Name            object
Age              int64
Gender          object
Total_Marks    float64
City            object
dtype: object

In [5]:
#3. Identify unique cities and count of students per city.
city = student['City'].nunique()
print("Unique_City Count :",city)

Unique_City Count : 5

In [6]:
# 4. Filter and display students with Total_Marks greater than or equal to 400.
t = student[student['Total_Marks'] >= 400]
print(t)

      StudentID            Name  Age Gender  Total_Marks       City
5          1006  Priscilla Cook   18      F        411.0     Mumbai
26         1027   Julian Martin   18      F        458.0  Bangalore
64         1065   Scott Collins   18      M        404.0    Chennai
65         1066      Jose Craig   18      F        401.0    Kolkata
72         1073     Travis Soto   14      M        486.0    Kolkata
...         ...             ...  ...    ...          ...        ...
1466       2467   Carrie George   16      F        433.0     Mumbai
1473       2474    Carlos Moore   16      M        406.0      Delhi
1480       2481    Leslie Smith   18      M        405.0  Bangalore
1484       2485  Melody Delgado   16      F        465.0      Delhi
1492       2493     Brian Pitts   14      M        424.0    Chennai

[132 rows x 6 columns]

In [7]:
# 5. Extract details of all female students and their scores.
fem = student[student['Gender'] == 'F'][['Name','Total_Marks']]
print(fem)

                  Name  Total_Marks
1       Taylor Jackson        327.0
2       Erica Lawrence        343.0
5       Priscilla Cook        411.0
8         Audrey Allen        285.0
12    Brittany Sanchez        342.0
...                ...          ...
1486     Cassidy Craig        300.0
1490       Ashley Hill        333.0
1495       Mark Horton        296.0
1496     Lisa Johnston        223.0
1499   Virginia Warren        187.0

[741 rows x 2 columns]

In [8]:
# 6 .Group students by City and compute the average Total_Marks and the total count per city.
g = student.groupby('City').agg(
    avg_marks=('Total_Marks', 'mean'),
    Count=('StudentID', 'count')
)

print(g)

            avg_marks  Count
City
Bangalore  301.895105    287
Chennai    304.613383    270
Delhi      299.372024    336
Kolkata    296.158416    305
Mumbai     299.269103    302

In [9]:
# 7 .Sort all students by Total_Marks in descending order.
sorted_students = student.sort_values(by='Total_Marks', ascending=False)
print(sorted_students)

      StudentID              Name  Age Gender  Total_Marks       City
400        1401       Ronald Lang   18      M        500.0    Chennai
1343       2344     Hannah Obrien   16      F        500.0  Bangalore
1208       2209    Nicole Cameron   18      M        500.0     Mumbai
1106       2107   Joseph Williams   16      F        497.0    Kolkata
437        1438  Ashley Hernandez   17      M        489.0    Chennai
...         ...               ...  ...    ...          ...        ...
41         1042      Daniel Baker   15      F          NaN  Bangalore
129        1130       Henry Walsh   17      M          NaN    Kolkata
198        1199  Douglas Reynolds   13      F          NaN    Kolkata
211        1212        Eric Jones   14      F          NaN     Mumbai
823        1824       Jason Fritz   17      F          NaN    Chennai

[1500 rows x 6 columns]

In [10]:
#8 . Reset the index of the sorted DataFrame.
sorted_students = sorted_students.reset_index(drop=True)

print(sorted_students)

      StudentID              Name  Age Gender  Total_Marks       City
0          1401       Ronald Lang   18      M        500.0    Chennai
1          2344     Hannah Obrien   16      F        500.0  Bangalore
2          2209    Nicole Cameron   18      M        500.0     Mumbai
3          2107   Joseph Williams   16      F        497.0    Kolkata
4          1438  Ashley Hernandez   17      M        489.0    Chennai
...         ...               ...  ...    ...          ...        ...
1495       1042      Daniel Baker   15      F          NaN  Bangalore
1496       1130       Henry Walsh   17      M          NaN    Kolkata
1497       1199  Douglas Reynolds   13      F          NaN    Kolkata
1498       1212        Eric Jones   14      F          NaN     Mumbai
1499       1824       Jason Fritz   17      F          NaN    Chennai

[1500 rows x 6 columns]

In [12]:
#9 . Detect missing Total_Marks values (simulate by setting ~10% missing).
import pandas as pd
import numpy as np

missing_indices = student.sample(frac=0.10, random_state=42).index
student.loc[missing_indices, 'Total_Marks'] = np.nan
missing_mask = student['Total_Marks'].isna()
missing_count = student['Total_Marks'].isna().sum()
print("\nTotal Missing Values in Total_Marks:", missing_count)
print("\nRows with Missing Total_Marks:")
print(student[student['Total_Marks'].isna()])

Total Missing Values in Total_Marks: 155

Rows with Missing Total_Marks:
      StudentID             Name  Age Gender  Total_Marks       City
15         1016  Nicole Guerrero   14      M          NaN    Chennai
23         1024     Jamie Watson   17      F          NaN     Mumbai
29         1030     Holly Foster   17      M          NaN     Mumbai
41         1042     Daniel Baker   15      F          NaN  Bangalore
44         1045     Shawn Nguyen   18      F          NaN  Bangalore
...         ...              ...  ...    ...          ...        ...
1452       2453   Kelly Buchanan   18      M          NaN  Bangalore
1470       2471  Derek Armstrong   13      M          NaN      Delhi
1473       2474     Carlos Moore   16      M          NaN      Delhi
1490       2491      Ashley Hill   15      F          NaN  Bangalore
1491       2492  Monique Douglas   15      M          NaN     Mumbai

[155 rows x 6 columns]

In [22]:
#10. Impute missing Total_Marks with the mean of the column.
mean_Value = student['Total_Marks'].mean()
fill =student['Total_Marks'].fillna(mean_Value, inplace =True)
print(student)

      StudentID             Name  Age Gender  Total_Marks       City
0          1001  Timothy Mendoza   14      M        365.0      Delhi
1          1002   Taylor Jackson   14      F        327.0      Delhi
2          1003   Erica Lawrence   13      F        343.0  Bangalore
3          1004    Rachel Murray   15      M        289.0    Kolkata
4          1005      Jesse Horne   17      M        356.0  Bangalore
...         ...              ...  ...    ...          ...        ...
1495       2496      Mark Horton   18      F        296.0    Kolkata
1496       2497    Lisa Johnston   14      F        223.0  Bangalore
1497       2498  Denise Campbell   16      M        258.0     Mumbai
1498       2499    Angel Sanders   18      M        240.0    Chennai
1499       2500  Virginia Warren   13      F        187.0    Chennai

[1500 rows x 6 columns]
Empty DataFrame
Columns: [StudentID, Name, Age, Gender, Total_Marks, City]
Index: []

C:\Users\XNovaQ.23\AppData\Local\Temp\ipykernel_2656\4026924467.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  fill =student['Total_Marks'].fillna(mean_Value, inplace =True)

In [24]:
# 11. Create a new column Result where students scoring >= 200 are marked as 'Pass', otherwise 'Fail'.
student['Result'] = student['Total_Marks'].apply((lambda x : 'Pass' if x>=200 else 'Fail'))
student

      StudentID             Name  Age Gender  Total_Marks       City Result
0          1001  Timothy Mendoza   14      M        365.0      Delhi   Pass
1          1002   Taylor Jackson   14      F        327.0      Delhi   Pass
2          1003   Erica Lawrence   13      F        343.0  Bangalore   Pass
3          1004    Rachel Murray   15      M        289.0    Kolkata   Pass
4          1005      Jesse Horne   17      M        356.0  Bangalore   Pass
...         ...              ...  ...    ...          ...        ...    ...
1495       2496      Mark Horton   18      F        296.0    Kolkata   Pass
1496       2497    Lisa Johnston   14      F        223.0  Bangalore   Pass
1497       2498  Denise Campbell   16      M        258.0     Mumbai   Pass
1498       2499    Angel Sanders   18      M        240.0    Chennai   Pass
1499       2500  Virginia Warren   13      F        187.0    Chennai   Fail

[1500 rows x 7 columns]

In [27]:
# 12. Count how many students failed and passed overall.
student['Result'].value_counts()

Result
Pass    1392
Fail     108
Name: count, dtype: int64

In [28]:
#13. Save the cleaned and modified DataFrame to a new CSV named students_cleaned.csv.
export = student.to_csv("students_cleaned.csv", index = False)
print(export)

None